#+TITLE: April 29, 2018 - May 15, 2018
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                            | CANCELED |
|------+------+-------------+---------+-------------------------------------------------+----------|
|      |      |             |         | READ.1525330886. JS The Good Parts (2018-05-15) |          |
|      |      |             |         | DEV.1525330927. FreeCodeCamp (2018-05-15)       |          |
|      |      |             |         | READ.1525330964. MDN (2018-05-15)               |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME     | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|----------+-----------+--------+------+-----------+--------------+------------|
| Sandeepk |      15.0 |  11.83 | 15.0 |         0 |   2018-05-17 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  16 +---------------------------------------------------------------------+   
:     |   ###############################################################   |   
:  14 |+  ....                                               ACTUAL #######+|   
:     |       ....                                            IDEAL ....... |   
:  12 |+          ...                                                    # +|   
:     |              .                                                   #  |   
:     |               .........                                          #  |   
:  10 |+                       ....                                      # +|   
:     |                            ....                                   # |   
:   8 |+                               ....                               #+|   
:     |                                    ....                           # |   
:   6 |+                                       ....                       #+|   
:     |                                            ....                    #|   
:   4 |+                                               ........            #|   
:     |                                                        .           #|   
:     |                                                         ....       #|   
:   2 |+                                                            ....   +|   
:     |                                                                 ....|   
:   0 +---------------------------------------------------------------------+   
:     0       2       4        6       8       10      12       14      16      
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                |
|-----+------------+--------+-------+------------------------------------------------|
|   1 | 2018-04-29 |   15.0 |    14 |                                                |
|   2 | 2018-04-30 |   15.0 |    13 |                                                |
|   3 | 2018-05-01 |   15.0 |    12 |                                                |
|   4 | 2018-05-02 |   15.0 |    11 |                                                |
|   5 | 2018-05-03 |   15.0 |    11 |                                                |
|   6 | 2018-05-04 |   15.0 |    10 |                                                |
|   7 | 2018-05-05 |   15.0 |     9 |                                                |
|   8 | 2018-05-06 |   15.0 |     8 |                                                |
|   9 | 2018-05-07 |   15.0 |     7 |                                                |
|  10 | 2018-05-08 |   15.0 |     6 |                                                |
|  11 | 2018-05-09 |   15.0 |     5 |                                                |
|  12 | 2018-05-10 |   15.0 |     4 |                                                |
|  13 | 2018-05-11 |   15.0 |     4 |                                                |
|  14 | 2018-05-12 |   15.0 |     3 |                                                |
|  15 | 2018-05-13 |   15.0 |     2 |                                                |
|  16 | 2018-05-14 |   15.0 |     1 |                                                |
|  17 | 2018-05-15 |    0.0 |     0 | READ.1525330964 DEV.1525330927 READ.1525330886 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM              | TASKID          | OWNER    | PRIORITY | TODO | ESTIMATED | ACTUAL |
|-------------------+-----------------+----------+----------+------+-----------+--------|
| TASKS             |                 |          | B        |      |      15.0 |  11.83 |
|-------------------+-----------------+----------+----------+------+-----------+--------|
| JS The Good Parts | READ.1525330886 | sandeepK | B        | DONE |       7.0 |   6.00 |
|-------------------+-----------------+----------+----------+------+-----------+--------|
| FreeCodeCamp      | DEV.1525330927  | sandeepK | B        | DONE |       5.0 |   3.83 |
|-------------------+-----------------+----------+----------+------+-----------+--------|
| MDN               | READ.1525330964 | sandeepK | B        | DONE |       3.0 |   2.00 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2018-04-29 Sun>
  :wpd-sandeepK:      1
  :END:
** DONE JS The Good Parts [3/3]
   CLOSED: [2018-05-15 Tue 21:01]
   :PROPERTIES:
   :ESTIMATED: 7.0
   :ACTUAL:   6.00
   :OWNER: sandeepK
   :ID: READ.1525330886
   :TASKID: READ.1525330886
   :END:
   :LOGBOOK:
   CLOCK: [2018-05-11 Fri 23:00]--[2018-05-12 Sat 00:00] =>  1:00
   CLOCK: [2018-05-10 Thu 23:00]--[2018-05-11 Fri 00:00] =>  1:00
   CLOCK: [2018-05-09 Wed 23:00]--[2018-05-10 Thu 00:00] =>  1:00
   CLOCK: [2018-05-08 Tue 23:00]--[2018-05-08 Tue 23:40] =>  0:40
   CLOCK: [2018-05-07 Mon 23:30]--[2018-05-08 Tue 00:00] =>  0:30
   CLOCK: [2018-05-06 Sun 23:00]--[2018-05-07 Mon 00:00] =>  1:00
   CLOCK: [2018-05-06 Sun 17:00]--[2018-05-06 Sun 17:50] =>  0:50
   :END:
   - [X] Chapter 1: Good part--1 hour
   - [X] Chapter 2: Grammar-- 3 hours
   - [X] Chapter 3: Objects-- 3 hours

** DONE FreeCodeCamp [2/2]
   CLOSED: [2018-05-15 Tue 21:00]
   :PROPERTIES:
   :ESTIMATED: 5.0
   :ACTUAL:   3.83
   :OWNER: sandeepK
   :ID: DEV.1525330927
   :TASKID: DEV.1525330927
   :END:
   :LOGBOOK:
   CLOCK: [2018-05-15 Tue 18:00]--[2018-05-15 Tue 18:30] =>  0:30
   CLOCK: [2018-05-15 Tue 14:00]--[2018-05-15 Tue 14:30] =>  0:30
   CLOCK: [2018-05-14 Mon 23:30]--[2018-05-15 Tue 00:00] =>  0:30
   CLOCK: [2018-05-14 Mon 12:00]--[2018-05-14 Mon 13:00] =>  1:00
   CLOCK: [2018-05-12 Sat 14:00]--[2018-05-12 Sat 15:20] =>  1:20
   :END:
   - [X] Basic javascript Exercise -- 3 hours
   - [X] Object-Oriented Functional Programming -- 2 hours

** DONE MDN
   CLOSED: [2018-05-15 Tue 21:03]
   :PROPERTIES:
   :ESTIMATED: 3.0
   :ACTUAL:   2.00
   :OWNER: sandeepK
   :ID: READ.1525330964
   :TASKID: READ.1525330964
   :END:
   :LOGBOOK:
   CLOCK: [2018-05-02 Wed 12:30]--[2018-05-02 Wed 13:30] =>  1:00
   CLOCK: [2018-05-01 Tue 23:00]--[2018-05-02 Wed 00:00] =>  1:00
   :END:

   Keyed collections -- 3 hours
   [https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Keyed_collections].

